#include <stdio.h>
#include <string.h>
#include <ctype.h>
/*------------------------ 사용자 정의 함수 선언: --------------------------*/
int IsSpace (char *ch);
int FindStrLen(char *str);
/****************************************************************************/
int main()
{
	char str[100]={0};
	char *p = str;
	int spacecnt=0;
	int i, len;

	gets(str);
	len = FindStrLen(p);

	for(i=0; i<len; i++)
	{
		if (IsSpace( p[i] ) != 0)
		{
			spacecnt++;
		}
	}
		
	printf("공백 문자의 개수는 : %d", spacecnt);
	
	return 0;
}
/*----------------------------- 사용자 정의 함수: --------------------------*/
/*****************************************************************************
Function : IsSpace
------------------------------------------------------------------------------
Desc	: 문자가 공백이면 1의 값을 return. 
Return	: None
*****************************************************************************/
int IsSpace (char *ch)
{
	if (ch == ' ')	{
		return 1;
	}
	else {
		return 0;
	}
}
/*****************************************************************************
Function : FindStrLen
------------------------------------------------------------------------------
Desc	: 문자열의 길이를 구하는 함수 
Params	: 1. int i - for문의 순서를 위한 변수 
				2. len - length 값을 return 받을 변수  
Return	: len
*****************************************************************************/
int FindStrLen(char *str)
{
	int i;
	int len = 0;
	for (i=0; ; i++)
	{
		if (str[i] == '\0') {
			break;
		}
		len++;
	}
	return len;
}


/*
입력 받은 문자열 중 
공백문자의 개수를 구해서
출력하는 프로그램.

공백문자인지 검사할 때는 표준 C라이브러리의
isspace 함수를 이용한다.
 
단 문자열의 각 문자가 
공백문자인지 검사할 떄 문자열 포인터 사용. 
*/
